data_generation/Training_Cases/Case6/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

8
(
    inlet
    {
        type            patch;
        nFaces          76;
        startFace       256062;
    }
    outlet
    {
        type            patch;
        nFaces          156;
        startFace       256138;
    }
    lowerWallStartup
    {
        type            symmetryPlane;
        inGroups        1(symmetry);
        nFaces          100;
        startFace       256294;
    }
    upperWallStartup
    {
        type            symmetryPlane;
        inGroups        1(symmetry);
        nFaces          100;
        startFace       256394;
    }
    upperWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1298;
        startFace       256494;
    }
    lowerWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1378;
        startFace       257792;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          128808;
        startFace       259170;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          128808;
        startFace       387978;
    }
)

// ************************************************************************* //
