data_generation/Training_Cases/Case6/system/sampleCp
type            patchProbes;
libs            ("libsampling.so");
writeControl    writeTime;

patch           lowerWall;
probeLocations  ();
fields          (cp);

